Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: ངན་སོང་ངན་འགྲོ་ཐམས་ཅད་གཅོད་པའི་སྟབས་དང་། བདེ་བ་ཐམས་ཅད་སྐྱེད་པའི་སྟབས་དང་། ཐར་པའི་ལམ་སྟོན་པའི་སྟབས་དང་། བདུད་ཀྱི་སྟོབས་སྟོབས་མེད་པར་བྱེད་པའི་སྟབས་དང་། ངན་པའི་ཚོགས་ཅན་གྱི་ཚོགས་ཕས་ཀྱི་རྒོལ་བ་ཆོས་དང་འཐུན་པས་ཚར་གཅད་པའི་སྟབས་དང་། མུན་པའི་ལིང་ཐོག་དང་། ཉོན་མོངས་པ་སེལ་བའི་སྟབས་དང་། འཁོར་བའི་ཕྱོགས་ཕྱོགས་མེད་པར་བྱེད་པའི་སྟབས་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། འཇིག་རྟེན་སྐྱོང་བ་རྣམས་ཟིལ་གྱིས་གནོན་པའི་སྟབས་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོ་ན་དཔའ་བོ་གཅིག་པུའི་སྟབས་དང་། རང་བྱུང་ཟིལ་གྱིས་གནོན་པའི་སྟབས་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཐོབ་པར་བྱེད་པའི་སྟབས་དང་། དྲན་པ་དང་བློ་གྲོས་ཀྱི་སྟབས་དང་། བདེ་འགྲོར་འགྲོ་བའི་སྟབས་དང་། རྒ་བ་དང་འཆི་བ་རབ་ཏུ་ཞི་བར་བྱེད་པའི་སྟབས་དང་། ཞི་བ་རྡུལ་མེད་པ། བདུད་ཀྱི་འཇིགས་པ་མེད་པ། མྱ་ངན་ལས་འདས་པའི་གྲོང་ཁྱེར་དུ་འགྲོ་བའི་སྟབས་ཏེ།
en: He had a stride that destroys all lower realms and all miserable existences, a stride that brings happiness to all beings, a stride that points out the path to liberation, a stride that renders powerless the strength of demons, a stride that suppresses evil opponents with their doctrines, a stride that removes the cataract of darkness and disturbing emotions, and a stride that undoes the workings of cyclic existence. He walked with a gait that outshines Śakra, Brahmā, Maheśvara, and the world protectors. His stride was that of the single lord of the great trichiliocosm, the spontaneous stride that cannot be overpowered, the stride that actualizes the attainment of omniscient wisdom, the stride of mindfulness and insight, the stride that leads to a happy rebirth, the stride that pacifies old age and death, the stride of stainless peace, the stride that leads to the city of nirvāṇa, which is auspicious, stainless, and free from fear.

source: དེ་འདྲ་བའི་སྟབས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་ཆས་སོ།
en: With such a stride the Bodhisattva set out for the seat of awakening.

source: །དགེ་སློང་དག་དེ་ལྟར་ཀླུང་ནཻ་རན་ཛ་ན་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་བར་དེར་རླུང་གི་སྤྲིན་གྱི་ལྷའི་བུ་རྣམས་ཀྱིས་ལམ་ཕྱག་དར་བྱས་པར་གྱུར་ཏོ། །ཆར་སྤྲིན་རྣམས་ཀྱིས་སྤོས་ཆུས་ཆག་ཆག་བཏབ་བོ། །མེ་ཏོག་ཀྱང་ཆལ་མར་བཀྲམ་མོ།
en: Monks, on the stretch between the Nairañjanā River and the seat of awakening, the gods of wind clouds swept the road for the Bodhisattva, while the gods of rain clouds sprinkled his path with scented water, and scattered flowers along the way.

source: །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་ཤིང་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཤིང་བྱང་ཆུབ་ག་ལ་བ་དེ་ལོགས་སུ་རྩེ་མོ་འདུད་པར་གྱུར་ཏོ།
en: At that point all the trees in this world of the great trichiliocosm bent their crowns toward the seat of awakening.

source: །གང་དག་དེའི་ཉིན་པར་བཙས་པའི་བྱིས་པ་དེ་དག་ཀྱང་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལོགས་སུ་མགོ་བསྟན་ཏེ་ཉལ་ལོ།
en: All the children who had been born on that very day now slept with their heads toward the seat of awakening.

source: །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་རི་རབ་ལ་སོགས་པ་རི་གང་དག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ག་ལ་བ་དེ་ལོགས་སུ་འདུད་པར་གྱུར་ཏོ།
en: Likewise all the mountains that exist in this world of the great trichiliocosm, such as Mount Meru, bowed toward the seat of awakening.

source: །ཀླུང་ནཻ་རན་ཛ་ན་ནས་བཟུང་སྟེ། བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་བར་དེར་འདོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་རྣམས་ཀྱིས་ཁ་ཚོན་རྒྱང་གྲགས་ཙམ་ཚུན་ཆད་ཀྱི་ལམ་མངོན་པར་བཀོད་པར་གྱུར་ཏོ།
en: All the way from the Nairañjanā River to the seat of awakening, the road had been beautified for a stretch of several miles by the gods of the desire realm.

source: །ལམ་དེའི་འགྲམ་གཡས་གཡོས་སུའང་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་སྟེགས་བུ་འཕང་དུ་ཤིང་ཏ་ལ་བདུན་ཙམ་དུ་མཐོ་བ། སྟེང་དུ་རིན་པོ་ཆེའི་དྲ་བ་བྲེས་པ། ལྷའི་གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་གྱིས་ལེགས་པར་བརྒྱན་པར་སྤྲུལ་ཏོ།
en: At both sides of the road, they had magically erected a railing made from the seven types of precious stones. The road was shaded, at the height of seven palm trees, with a jeweled latticework and adorned with divine parasols, flags, and banners.

source: །མདའ་རྒྱང་གང་ཙམ། མདའ་རྒྱང་གང་ཙམ་གྱི་ཞིང་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཤིང་ཏ་ལ་སྟེགས་བུ་དེ་བས་མཐོ་བ་མངོན་པར་སྤྲུལ་ཏེ།
en: At a distance of an arrow’s flight, they had emanated a row of palm trees made of the seven types of precious stones and taller than the railing.

source: ཤིང་ཏ་ལ་ཐམས་ཅད་རིན་པོ་ཆེ་བརྒྱུས་པས་ཕན་ཚུན་འབྲེལ་བར་འདུག་གོ།
en: Between all the palm trees, jewel garlands were strung.

source: །ཤིང་ཏ་ལ་གཉིས་གཉིས་ཀྱི་བར་དུ་རྫིང་སྤོས་ཆུས་ཡོངས་སུ་གང་བ་གསེར་གྱི་བྱེ་མ་བདལ་བ། མེ་ཏོག་ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་ལ་སོགས་པས་གང་བ།
en: In between each pair of palm trees, a lotus pond was built, filled with scented water, lined with golden sand, and covered in blue, yellow, red, and white lotuses.

source: རིན་པོ་ཆེའི་སྟེགས་བུས་བསྐོར་བ། ནོར་བུ་རིན་པོ་ཆེ་བཻ་དཱུ་རྱས་ཐེམ་སྐས་བརྒྱན་པ།
en: Jewel ledges and beryl staircases surrounded the ponds.

source: ཆུ་སྲེག་དང་། བྱ་གར་དང་། ངང་པ་དང་། ངུར་པ་དང་། ཁྲུང་ཁྲུང་དང་། རྨ་བྱ་སྒྲ་འབྱིན་པའི་རྫིང་དག་བྱས་སོ།
en: The ponds resounded with the calls of ducks, storks, swans, geese, cranes, and peacocks.

source: །ལམ་དེ་ན་ལྷའི་བུ་མོ་བརྒྱད་ཁྲི་ནི་སྤོས་ཆུས་ཆག་ཆག་འདེབས་སོ། །
en: Eighty thousand divine maidens sprinkled the path with flowers of divine scent.

source: ལྷའི་བུ་མོ་བརྒྱད་ཁྲི་ནི་མེ་ཏོག་སིལ་མ་ལྷའི་དྲི་བསུང་དང་ལྡན་པ་འཐོར་རོ། །ཤིང་ཏ་ལ་ཐམས་ཅད་ཀྱི་མདུན་ལོགས་སུ་རིན་པོ་ཆེའི་མཁའ་རྟེན་བཞག་གོ། །རིན་པོ་ཆེའི་མཁའ་རྟེན་ཐམས་ཅད་ལ་ལྷའི་བུ་མོ་ཙན་དན་དང་། ཨ་ག་རུའི་ཕྱེ་མའི་ཕུར་མ་ཐོགས་པ་དང་། དུས་ཀྱི་རྗེས་སུ་འབྲང་བའི་བདུག་པའི་པོག་ཕོར་ཐོགས་པ་བརྒྱད་ཁྲི་འཁོད་པར་གྱུར་ཏོ།
en: In front of each of the palm trees was a jewel podium on which eighty thousand divine maidens stood, proffering containers with powders of sandal and aloeswood, and holding up lighted incense burners with sandalwood.

source: །རིན་པོ་ཆེའི་མཁའ་རྟེན་ཐམས་ཅད་ལ་ལྷའི་བུ་མོ་ལྷའི་གླུ་དབྱངས་ལེན་པ་ལྔ་ཁྲི་འཁོད་པར་གྱུར་ཏོ།
en: On each of these jewel podiums were also five thousand divine maidens singing celestial songs.

source: །དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཞིང་རྣམས་ནི་རབ་ཏུ་སྐྱོད། འོད་ཟེར་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ནི་འབྱིན། སིལ་སྙན་བརྒྱ་སྟོང་ནི་སྒྲོགས། མེ་ཏོག་མང་པོའི་ཆར་ཆེན་པོ་ནི་འབེབས། གོས་བརྒྱ་སྟོང་གི་གཡབ་མོ་ནི་འདོར། རྔ་བོ་ཆེ་བརྒྱ་སྟོང་ནི་རྡུང་། རྟ་དང་གླང་པོ་ཆེ་དང་། གླང་ཁྱུ་བ་རྣམས་ནི་སྒྲ་འབྱིན། བྱ་ནེ་ཙོ་དང་། རི་སྐེགས་དང་། ཁུ་བྱུག་དང་། ཀ་ལ་པིང་ཀ་དང་། ཤང་ཤང་ཏེའུ་དང་། ངང་པ་དང་། ངུར་པ་དང་། ཁྲུང་ཁྲུང་དང་། རྨ་བྱ་བརྒྱ་སྟོང་ནི་བསྐོར་བ་བྱེད། བཀྲ་ཤིས་བརྒྱ་སྟོང་ནི་འབུལ་ཞིང་ལམ་གྱི་བཀོད་པ་རྣམ་པ་དེ་ལྟ་བུ་དེས། བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་སོང་ངོ་།
en: Monks, in this way the Bodhisattva proceeded on his way, emitting trillions of light rays, while the realms shook, music played from millions of instruments, a great rain with an abundance of flowers fell, millions of silken banners fluttered in the wind, millions of drums resounded as they were beaten, and horses, elephants, and bulls circumambulated the Bodhisattva. Hundreds of thousands of parrots, mynas, cuckoos, partridge, swans, sandpipers, peacocks, and cakrāvaka birds were drawn into the Bodhisattva’s presence.

source: །གང་གི་ནུབ་མོ་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འདོད་པར་གྱུར་པ་དེ་ཉིད་ཀྱི་ནུབ་མོ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་བདག་པོ་ཚངས་པ་དབང་སྒྱུར་ཞེས་བྱ་བ་དེས་ཚངས་པའི་འཁོར་ཆེན་པོ་དེ་ལ་བོས་ཏེ།
en: Adorned with hundreds of thousands of auspicious signs, such was the road on which the Bodhisattva traveled on his way to the seat of awakening. On that night, the very night when the Bodhisattva set his aim on attaining full and complete awakening, the all-powerful Brahmā, the ruler of the great trichiliocosm, called out to his large retinue in the Brahma realm.

source: འདི་སྐད་ཅེས་སྨྲས་སོ། ། གྲོགས་པོ་དག་ཤེས་པར་གྱིས་ཤིག །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གོ་ཆ་ཆེན་པོ་མནབས་པ།
en: “Friends,” he said, “you should be aware of this. The Bodhisattva, the Great Being, has donned the great armor.

source: དམ་བཅས་པ་ཆེན་པོ་མ་བོར་བ། གོ་ཆ་སྲ་བ་མནབས་པ། ཐུགས་ཡོངས་སུ་མི་སྐྱོ་བ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་ཚར་ཕྱིན་པ།
en: Without forsaking his great vow, protected by his solid armor, he is undeterred and has perfected all the conduct of a bodhisattva.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་བྱོན་པ། བྱང་ཆུབ་སེམས་དཔའི་ས་ཐམས་ཅད་ལ་མངའ་དབང་བརྙེས་པ།
en: He has reached the further shore of all the perfections and become a master of all the grounds of a bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའི་བསམ་པ་ཐམས་ཅད་ཀྱི་བྱ་བ་ཤིན་ཏུ་མཁྱེན་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོའི་རྗེས་སུ་ཞུགས་པ།
en: He is perfectly pure in his aspirations of a bodhisattva and joins in the five spiritual faculties of all sentient beings.

source: དེ་བཞིན་གཤེགས་པའི་གསང་བ་ཐམས་ཅད་ལ་ཤིན་ཏུ་ཞུགས་པ་བདུད་ཀྱི་ལས་ཀྱི་ལམ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པ།
en: He has entered the secret locations of all the thus-gone ones and is beyond all paths of demonic activity.

source: དགེ་བའི་རྩ་བ་ཐམས་ཅད་ལ་གཞན་གྱི་དྲིང་མི་འཇོག་པ།
en: He is not dependent on others regarding the basis for acquiring merit.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པ།
en: He is blessed by all thus-gone ones.

source: སེམས་ཅན་ཐམས་ཅད་ལ་རབ་ཏུ་ཐར་པའི་ལམ་སྟོན་པ།
en: He demonstrates the path to complete freedom for all sentient beings.

source: དེད་དཔོན་ཆེན་པོར་གྱུར་པ། བདུད་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་འཇོམས་པར་མཛད་པ།
en: He is a great captain who conquers the circle of Māra’s army.

source: སྟོང་གསུམ་ན་དཔའ་བོ་གཅིག་པུར་གྱུར་པ།
en: He is the single hero of the trichiliocosm.

source: ཆོས་ཀྱི་སྨན་ཐམས་ཅད་ཡང་དག་པར་བསྒྲུབས་པ། སྨན་པའི་རྒྱལ་པོ་ཆེན་པོ་རྣམ་པར་གྲོལ་བའི་ཐབས་ཐོབ་པ།
en: “He has accomplished all the medicines of Dharma and is the great king of physicians, wearing a silken headband of salvation.

source: ཆོས་ཀྱི་རྒྱལ་པོ་ཆེན་པོ་ཤེས་རབ་ཀྱི་འོད་ཆེན་པོ་གཏོང་བ།
en: He is the great Dharma king who shines the bright light of knowledge.

source: ཏོག་ཆེན་པོའི་རྒྱལ་པོ་འཇིག་རྟེན་གྱི་ཆོས་བརྒྱད་ཀྱིས་མ་གོས་པས་པད་མ་ཆེན་པོ་ལྟ་བུ།
en: He is a great meteor-like king who, like a magnificent lotus flower, is unstained by the eight worldly concerns.

source: ཆོས་ཐམས་ཅད་ཀྱི་གཟུངས་མ་བསྙེལ་བ།
en: He never forgets the dhāraṇīs of any teaching.

source: རྒྱ་མཚོ་ཆེན་པོ་དང་འདྲ་བ། རྗེས་སུ་ཆགས་པ་དང་ཁོང་ཁྲོ་བ་དང་བྲལ་བ།
en: He is like a great ocean, free from attachment and aversion.

source: མི་གཡོ་བ། མི་བསྐྱོད་པ། རི་རབ་ཆེན་པོ་ལྟ་བུ།
en: He is immovable and unshakable like the great central mountain.

source: ཤིན་ཏུ་དྲི་མ་མེད་པ། ཤིན་ཏུ་ཡོངས་སུ་དག་པ། ཤིན་ཏུ་དཀར་བའི་བློ་དང་ལྡན་པ། ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དང་འདྲ་བ།
en: He is utterly stainless, pure, and in possession of a very wholesome mind, and thus he is like a great jewel.

source: ཆོས་ཐམས་ཅད་ལ་དབང་བསྒྱུར་བ། སེམས་ལས་སུ་རུང་བ།
en: He has become a master of all phenomena and is, in all his actions, beyond intentions.

source: ཚངས་པ་ཆེན་པོ་ལྟ་བུའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་བདུད་ཀྱི་སྡེ་རབ་ཏུ་འདུལ་བ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་བཞེད་པ་དང་། སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཡོངས་སུ་རྫོགས་པར་མཛད་པ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་ཆེན་པོ་བསྐོར་བ་དང་། སེང་གེའི་སྒྲ་ཆེན་པོ་བསྒྲག་པ་དང་། ཆོས་ཀྱི་སྦྱིན་པས་སེམས་ཅན་ཐམས་ཅད་ཚིམ་པར་མཛད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་མིག་རྣམ་པར་སྦྱང་བ་དང་། ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཆོས་དང་འཐུན་པས་ཚར་གཅད་པ་དང་། སྔོན་དམ་བཅས་པ་ཡོངས་སུ་རྫོགས་པ་ཀུན་ཏུ་བསྟན་པ་དང་། ཆོས་ཐམས་ཅད་ལ་དབང་ཕྱུག་གི་མངའ་དབང་བརྙེས་པར་མཛད་པའི་ཕྱིར་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་བཞུད་ཀྱིས།
en: “The Bodhisattva, who is like the great Brahmā, proceeds to the seat of awakening with the desire to awaken to unexcelled, perfect, and complete buddhahood in order to tame the armies of Māra. He proceeds in order to perfectly accomplish the ten powers, the fourfold fearlessness, and the eighteen unique qualities of a buddha. His aim is to turn the great wheel of Dharma and utter the lion’s great roar. With the gift of Dharma, he will satisfy all sentient beings. He will purify the eye of Dharma of all sentient beings and annihilate all his opponents together with their doctrines. He goes to the seat of awakening to demonstrate the fulfillment of his previous vows and to gain a ruler’s complete mastery over all phenomena.

source: དེ་ལ་གྲོགས་པོ་དག་ཁྱེད་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པ་དང་། རིམ་གྲོ་བྱ་བའི་ལས་ཐམས་ཅད་ལ་སྤྲོ་བར་གྱིས་ཤིག །དེ་ནས་ཚངས་པ་ཆེན་པོ་དབང་སྒྱུར་གྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: Friends, for these reasons you should pay homage to the Bodhisattva and joyfully assist him in every way possible!” Then at that point the all-powerful Brahmā spoke these verses:

source: །གང་གི་བསོད་ནམས་དག་དང་གཟི་བརྗིད་དཔལ་གྱིས་བྱམས་དང་སྙིང་རྗེ་དགའ་བ་དང་། །བཏང་སྙོམས་དང་ནི་བསམ་གཏན་དག་དང་དེ་བཞིན་མངོན་ཤེས་ཚངས་པའི་ལམ་སྣང་བ།
en: “He, by whose merits and glorious splendor the great path can be known— Love, compassion, joy, and equanimity, as well as the absorptions and the types of higher knowledge—

source: །བསྐལ་པ་སྟོང་དུ་སྤྱོད་པ་སྤྱད་པ་དེ་ནི་བྱང་ཆུབ་ཤིང་དྲུང་ཆས་པར་གྱུར།
en: Has practiced wholesome conduct for a thousand eons and now sets out for the Bodhi tree.

source: །ཐུབ་པ་དེ་ལ་བསམ་པའི་བརྟུལ་ཞུགས་སྒྲུབ་པར་བྱེད་པའི་མཆོད་པ་ལེགས་པར་བྱ།
en: You should make offerings to that sage as he practices to fulfill his aspirations.

source: །དེ་ལ་སྐྱབས་སུ་སོང་ན་ངན་འགྲོའི་འཇིགས་དང་མི་ཕྲད་མི་ཁོམ་མི་འགྱུར་ཏེ།
en: “Take refuge in him, and you will not meet or experience the fears of the lower realms or the lack of the freedoms;

source: །ལྷ་ཡི་ནང་དུ་འདོད་པའི་བདེ་བ་རྙེད་ནས་ཚངས་པའི་གནས་ཡངས་འགྲོ་བར་འགྱུར།
en: Instead you will find the happiness of desire-realm gods in the vast abode of Brahmā.

source: །ལོ་དྲུག་བར་དུ་དཀའ་བ་སྤྱད་པ་སྤྱད་ནས་འདི་ནི་བྱང་ཆུབ་ཤིང་དྲུང་བཞུད།
en: He went through hardship for six years, and now he departs for the Bodhi tree. Well done!

source: །ཀུན་ཀྱང་དགའ་ཞིང་རབ་ཏུ་མགུ་བའི་ཡིད་ཀྱིས་དེ་ལ་མཆོད་པ་ལེགས་པར་གྱིས།
en: Let us all venerate this man with joy and devotion!

source: །དེ་ནི་སྟོང་གསུམ་རྒྱལ་པོ་དབང་ཕྱུག་དམ་པ་ཆོས་ཀྱི་དབང་ཕྱུག་རྒྱལ་པོ་སྟེ།
en: “He is the king of the trichiliocosm, the best of masters, the royal master of Dharma;

source: །བརྒྱ་བྱིན་ཚངས་པ་ཉི་ཟླའི་གྲོང་ཁྱེར་དག་ན་དེ་དང་མཉམ་པ་གང་ཡང་མེད།
en: In the cities of Indra, Brahmā, Sūrya, and Candra, there is no equal to him.

source: །གང་བཙས་ཚེ་ན་ཞིང་རྣམས་བྱེ་བ་ཁྲག་ཁྲིག་རྣམ་པ་དྲུག་ཏུ་གཡོས་གྱུར་པ།
en: When he was born, one trillion worlds quaked in six different ways;

source: །དེ་ནི་དེ་རིང་བདུད་ཀྱི་དཔུང་ལས་རྒྱལ་བར་མཛད་ཕྱིར་ཤིང་ཆེན་མཆོག་དྲུང་བཞུད།
en: Today he sets out for the supreme magnificent tree to conquer the armies of Māra.

source: །གང་གི་སྤྱི་གཙུག་ཚངས་པའི་གནས་འདིར་གནས་ཀྱང་བལྟ་བར་ནུས་པ་མ་ཡིན་ཞིང་།
en: “The crown of his head I cannot see, nor can the others here in the Brahmā realm;

source: །གང་གི་སྐུ་ལ་མཚན་རབ་དམ་པ་ལྡན་ཞིང་སུམ་ཅུ་རྩ་གཉིས་ལེགས་བརྒྱན་ལ།
en: His body, bearing the best of the excellent marks, is adorned with the thirty-two;

source: །གང་གི་གསུང་འདིར་ཡིད་དུ་འོང་ཞིང་སྙན་ལ་རྣར་འཐད་ཚངས་དབྱངས་སྒྲ་སྙན་ཅིང་།
en: His speech is beautiful, sweet, and pleasant to hear, a voice melodious like that of Brahmā;

source: །གང་གི་ཐུགས་ནི་རབ་ཞི་ཁྲོ་དང་བྲལ་བ་དེ་ལ་མཆོད་པ་བྱེད་དུ་འདོང་།
en: His mind is calm and free from anger. Come, let’s pay him homage!

source: །གང་དག་བློ་གྲོས་བརྒྱ་བྱིན་ཚངས་པའི་གནས་སུ་བསམ་གཏན་བདེ་བས་འདའ་བྱ་དང་། །ཉོན་མོངས་འཆིང་བའི་འཁྲི་ཤིང་ཀུན་དང་དྲ་བ་དེ་དག་གཅོད་པར་བྱེད་འདོད་དང་། །གཞན་ལས་མ་ཐོས་པར་ནི་རང་རྒྱལ་བྱང་ཆུབ་ཞི་བ་འཆི་མེད་འཐོབ་འདོད་དང་། །གལ་ཏེ་ས་གསུམ་དག་ན་སངས་རྒྱས་ཉིད་འདོད་དེ་དག་འདྲེན་པ་མཆོད་པར་གྱིས།
en: “Intelligent ones who aim to transcend the perpetual bliss in the realms of Indra and Brahmā, Or those who wish to cut the net of the fettering vines of disturbing emotions, Or those wishing to attain immortality without hearing about it from others, which is an auspicious solitary awakening— If anyone desires awakening, they should pay homage, in the three realms, to this guide‌.

source: །གང་གིས་རྒྱ་མཚོར་བཅས་པའི་ས་དང་དེ་བཞིན་རིན་པོ་ཆེ་རྣམས་མཐའ་ཡས་དང་། །ཁང་བཟངས་སྐར་ཁུང་བསིལ་ཁང་མང་ལྡན་པ་དང་ཟུང་དུ་སྦྲེལ་དང་བཞོན་པ་དང་། །མེ་ཏོག་ཕྲེང་བ་ཤིན་ཏུ་མཛེས་པས་བརྒྱན་པ་སྐྱེད་མོས་ཚལ་གྱིས་རབ་བརྒྱན་དང་། །རྐང་ལག་མགོ་དང་མིག་རྣམས་ཡོངས་སུ་བཏང་བ་དེ་ནི་བྱང་ཆུབ་སྙིང་པོར་ཞུགས།
en: “He has renounced the earth with its oceans, along with countless precious objects. He has abandoned palaces with their oval windows and terraces, as well as conveyances, And the land adorned with exquisite flowers, with beautiful parks, springs, and ponds. He gave up his limbs, his head, and his eyes, and now he walks to the seat of awakening!”

source: །དགེ་སློང་དག་དེ་ལྟར་སྟོང་གསུམ་གྱི་ཚངས་པ་ཆེན་པོ་དེ་སྐད་ཅིག་དེ་ལ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་ཕྱིན་ཏེ།
en: Monks, the great Brahmā, who presides over the trichiliocosm, then made, in a single moment, all the worlds in the great trichiliocosm the same.

source: ལག་མཐིལ་ལྟར་མཉམ་པར་གྱུར་པ།
en: The world had now become smooth, like the palm of a hand.

source: གྱོ་མོ་དང་རྡོ་མེད་པ་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་དཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱུ་རུ་དང་། གསེར་དང་། དངུལ་མང་བ།
en: There was no longer any gravel or rocks, and instead the world was filled with jewels, pearls, cat’s-eye gems, conch shells, crystals, corals, gold, and silver.

source: རྩྭ་སྔོ་ཞིང་འཇམ་ལ་གཡས་སུ་འཁྱིལ་ཅིང་གཡུང་དྲུང་འཁྱིལ་པ་ཀ་ཙ་ལིན་དི་ཀའི་གོས་ལྟར་རེག་ན་བདེ་བ་དག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཁྱབ་པ་འདིར་ཕྱིན་ཏོ།
en: He covered this entire world of the great trichiliocosm in soft green grass, curled to the right in the pattern of a swastika, soft as the finest cloth, and pleasant to the touch.

source: །དེའི་ཚེ་རྒྱ་མཚོ་ཆེན་པོ་ཐམས་ཅད་ས་ལྟ་བུར་གྱུར་ཀྱང་ཆུ་ན་རྒྱུ་བའི་སེམས་ཅན་རྣམས་ལ་གནོད་པ་ཅུང་ཟད་ཀྱང་མེད་དོ།
en: At that moment, all the great oceans had also become as peaceful as dry land, and all the beings who live in the waters had become free from any harm.

source: །འཇིག་རྟེན་གྱི་ཁམས་དེ་ལྟར་བརྒྱན་པ་འདི་ཕྱོགས་བཅུའི་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་རྣམས་ཀྱིས་མཐོང་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱ་སྟོང་ལེགས་པར་བརྒྱན་ཏོ།
en: When all the worldly guardians in the ten directions, such as Indra and Brahmā, saw how beautiful the world had become, they decided to venerate the Bodhisattva by adorning a hundred thousand buddha realms in the same way.

source: །བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཀྱང་ལྷའི་དང་མིའི་ལས་ཤིན་ཏུ་འདས་པའི་མཆོད་པ་བཀོད་པ་རྣམས་ཀྱིས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་དཔག་ཏུ་མེད་པ་བརྒྱན་པར་གྱུར་ཏོ།
en: All other bodhisattvas who are beyond the world of humans and gods also wished to venerate the Bodhisattva, and therefore they adorned the limitless buddha realms in the ten directions with an array of offerings.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཐམས་ཅད་ཀྱང་བཀོད་པའི་རྒྱན་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པས་སངས་རྒྱས་ཀྱི་ཞིང་གཅིག་ལྟ་བུར་སྣང་བར་གྱུར་ཏོ།
en: All these buddha realms, even though they were adorned in different ways, now appeared as one single buddha realm.

source: །འཇིག་རྟེན་གྱི་བར་དག་དང་། རི་ནག་པོ་དང་། ཁོར་ཡུག་དང་། ཁོར་ཡུག་ཆེན་པོ་དག་ཀྱང་མི་སྣང་བར་གྱུར་ཏོ།
en: All the space between the worlds had disappeared, as had the encircling black mountains and the smaller and greater perimeter walls.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཐམས་ཅད་ནི་བྱང་ཆུབ་སེམས་དཔའི་འོད་ཀྱིས་གསལ་བར་སྣང་ངོ་།
en: All these buddha realms could be seen permeated with the light streaming from the Bodhisattva.

source: །བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ཡོངས་སུ་སྐྱོང་བའི་ལྷའི་བུ་བཅུ་དྲུག་ཡོད་དེ། །འདི་ལྟ་སྟེ།
en: At the seat of awakening, there were sixteen gods who guarded the place.

source: ལྷའི་བུ་ཨུད་ཀ་ལི་ཞེས་བྱ་བ་དང་། ལྷའི་བུ་མུད་ཀ་ལི་ཞེས་བྱ་བ་དང་། སྐྱེ་དགུའི་བདག་པོ་དང་། དཔའ་སྟོབས་དང་། དཔུང་རྒྱན་སྟོབས་དང་། རབ་བརྟན་དང་། ས་འཛིན་དང་། སྣང་བྱེད་དང་། དྲི་མ་མེད་དང་། ཆོས་ཀྱི་དབང་ཕྱུག་དང་། ཆོས་ཀྱི་ཏོག་དང་། འགྲོ་གྲུབ་དང་། མིག་ཐོགས་པ་མེད་དང་། བཀོད་པ་ཆེན་པོ་དང་། ཚུལ་ཁྲིམས་རྣམ་དག་དྲི་ལྡན་དང་། པད་མའི་འོད་དེ།
en: Their names were Utkhalin, Sūtkhalin, Prajāpati, Śūrabhala, Keyūrabala, Supratiṣṭhita, Mahindhara, Avabhāsakara, Vimala, Dharmeśvara, Dharmaketu, Siddhapātra, Apratihata­netra, Mahāvyūha, Śila­viśuddha­netra, and Padmaprabha.

source: ལྷའི་བུ་བཅུ་དྲུག་པོ་དེ་དག་ནི་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ཡོངས་སུ་སྐྱོང་བ་དག་སྟེ། ཐམས་ཅད་ཀྱང་ཕྱིར་མི་ལྡོག་པའི་བཟོད་པ་ཐོབ་པ་ཤ་སྟག་གོ།
en: It was these sixteen gods, all of whom had attained irreversible patience, who guarded the seat of awakening.

source: །དེ་དག་གིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་བརྒྱན་ཏེ།
en: As a way to venerate the Bodhisattva, they had adorned the seat of awakening.

source: དཔག་ཚད་བརྒྱད་ཅུ་ཁོར་ཡུག་ཏུ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་སྟེགས་བུ་རིམ་པ་བདུན་གྱིས་ནི་བསྐོར།
en: At a distance of eighty leagues, they had encircled the place with railings, built in seven rows.

source: ཤིང་ཏ་ལའི་ཕྲེང་བ་རིམ་བདུན་དང་། རིན་པོ་ཆེའི་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་རིམ་བདུན་དང་། རིན་པོ་ཆེ་བརྒྱུས་པ་རིམ་པ་བདུན་གྱིས་ནི་བསྐོར། འཛམ་བུའི་ཆུ་བོའི་གསེར་གྱི་གླེགས་བམ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་སྤྲས་པ་དག་དང་། གསེར་གྱི་ཙོང་ཙོང་དག་དང་། འཛམ་བུའི་ཆུ་བོའི་གསེར་གྱི་པད་མ་དག་གིས་ནི་ཁེབས་པར་བྱས། སྙིང་པོ་མཆོག་གི་སྤོས་ཀྱིས་ནི་བདུགས། རིན་པོ་ཆེའི་དྲ་བ་ནི་བྲེས་སོ།
en: Palm trees were also placed in seven circles, and a sevenfold lattice with bells of precious stones enfolded it. All of this was surrounded with seven threads made of precious materials. The seat of awakening was covered with cloth made of gold from the Jambū River, a cloth studded with seven precious gems and woven with a golden thread. It was bestrewn with lotuses of gold from the Jambū River, scented with aromatic essences, and covered by a jewel canopy.

source: །ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐ་དད་པ་དག་ན་ཤིང་སྣ་ཚོགས་མངོན་པར་འཕགས་པ། བཟང་བ་མངོན་དུ་མཆོད་པ། ལྷ་ཡུལ་བ་དང་། མི་ཡུལ་བ་གང་དག་ན་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་དེར་སྣང་བར་གྱུར་ཏོ།
en: All the beautiful and excellent trees that grow and are venerated in all the different worlds in the ten directions, including the worlds of gods and humans, now manifested at the seat of awakening.

source: །ཕྱོགས་བཅུ་དག་ན་ཆུ་ནས་སྐྱེ་བ་དང་། ཐང་ལས་སྐྱེ་བའི་མེ་ཏོག་རྣམ་པ་སྣ་ཚོགས་གང་དག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་དེར་སྣང་བར་གྱུར་ཏོ།
en: Likewise all the different species of flowers that grow in water as well as on land manifested there at the seat of awakening.

source: །ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐ་དད་པ་དག་ན། བྱང་ཆུབ་སེམས་དཔའ་གང་དག་བསོད་ནམས་དང་། ཡེ་ཤེས་ཀྱི་ཚོགས་ཚད་མེད་པའི་བཀོད་པ་དག་གིས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་བརྒྱན་པར་བྱེད་པ་དེ་དག་ཀྱང་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་དེར་སྣང་བར་གྱུར་ཏོ།
en: Moreover, the bodhisattvas in all the various worlds in the ten directions now became visible at the seat of awakening, adorning the place with their immeasurable accumulations of merit and wisdom.

source: །དེ་ལྟར་ལྷའི་བུ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ཡོངས་སུ་སྐྱོང་བ་དག་གིས་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་བཀོད་པ་དེ་འདྲ་བ་དག་སྤྲུལ་པར་གྱུར་ཏེ།
en: In this way, the gods who guarded the seat of awakening magically manifested such displays at that place.

source: དེ་དག་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དག་གིས་མཐོང་ནས་རང་རང་གི་གནས་ལ་དུར་ཁྲོད་ཙམ་གྱི་འདུ་ཤེས་སྐྱེད་པར་གྱུར་ཏོ།
en: They were so magnificent that when the gods, nāgas, yakṣas, gandharvas, and demigods witnessed them, they began to conceive of their own abodes as nothing more than charnel grounds.

source: །བཀོད་པ་དེ་དག་མཐོང་ནས་ཤིན་ཏུ་ངོ་མཚར་ཆེར་འཛིན་ཏེ།
en: As they saw the displays, they felt great respect and exclaimed with joy,

source: ཨེ་མའོ་བསོད་ནམས་ཀྱི་རྣམ་པར་སྨིན་པའི་རྒྱུ་འཐུན་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལེགས་སོ་ཞེས་ཆེད་དུ་བརྗོད་པའང་ཆེད་དུ་བརྗོད་དོ།
en: “How great! What an inconceivable manifestation of meritorious ripening this is!”

source: །བྱང་ཆུབ་ཀྱི་ཤིང་གི་ལྷ་མོ་བཞི་ཡོད་དེ་འདི་ལྟ་སྟེ།
en: At the Bodhi tree itself there were four deities:

source: འོད་མ་དང་། སྙན་ལྡན་དང་། ཡིད་བཟངས་དང་། མདངས་ལྡན་མ་སྟེ།
en: Veṇu, Valgu, Sumanas, and Ojopati.

source: བྱང་ཆུབ་ཀྱི་ཤིང་གི་ལྷ་མོ་བཞི་པོ་དེ་དག་གིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་ཀྱི་ཤིང་རྩ་བ་ཕུན་སུམ་ཚོགས་པ། སྡོང་པོ་ཕུན་སུམ་ཚོགས་པ། ཡལ་ག་དང་། ལོ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་སྣ་ཚོགས་ཕུན་སུམ་ཚོགས་པ། ཁྲུན་དང་སྦོམས་ཕུན་སུམ་ཚོགས་པ་མཛེས་པ།
en: These four deities of the Bodhi tree also wished to venerate the Bodhisattva, and therefore they modeled the Bodhi tree to give it perfect roots, trunk, branches, leaves, flowers, and fruits, as well as a perfect height and circumference.
